GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_serial.c
/****************************************************************************
 * arch/arm/src/gd32e11x/gd32e11x_serial.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/serial/serial.h>
#include <nuttx/spinlock.h>
#include <nuttx/power/pm.h>

#ifdef CONFIG_SERIAL_TERMIOS
#  include <termios.h>
#endif

#include <arch/board/board.h>

#include "chip.h"
#include "gd32e11x.h"
#include "gd32e11x_gpio.h"
#include "gd32e11x_rcu.h"
#include "gd32e11x_lowputc.h"

#include "gd32e11x_serial.h"

#include "arm_internal.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Is there at least one USART enabled and configured as a RS-232 device? */

/* Power management definitions */

#if defined(CONFIG_PM) && !defined(CONFIG_GD32E11X_PM_SERIAL_ACTIVITY)
#  define CONFIG_GD32E11X_PM_SERIAL_ACTIVITY 10
#endif

#if defined(CONFIG_PM)
#  define PM_IDLE_DOMAIN             0 /* Revisit */
#endif

/* If we are not using the serial driver for the console, then we still must
 * provide some minimal implementation of up_putc.
 */

#ifdef USE_SERIALDRIVER

#  ifdef HAVE_SERIALDRIVER

#    if defined(SERIAL_HAVE_RXDMA) || defined(SERIAL_HAVE_TXDMA)

/* USART DMA priority */
#      if defined(CONFIG_GD32E11X_USART_PRIQ)
#        define USART_DMA_PRIO  CONFIG_GD32E11X_USART_PRIQ
#      else
#        define USART_DMA_PRIO  DMA_PRIO_MEDIUM_SELECT
#      endif
#    endif

#    ifdef SERIAL_HAVE_RXDMA
/* The DMA buffer size when using RX DMA to emulate a FIFO.
 *
 * When streaming data, the generic serial layer will be called every time
 * the FIFO receives half this number of bytes.
 */
#    if !defined(CONFIG_GD32E11X_SERIAL_RXDMA_BUFFER_SIZE)
#      define CONFIG_GD32E11X_SERIAL_RXDMA_BUFFER_SIZE 32
#    endif
#    define RXDMA_BUFFER_MASK   (4 - 1)
#    define RXDMA_BUFFER_SIZE   ((CONFIG_GD32E11X_SERIAL_RXDMA_BUFFER_SIZE \
                                + RXDMA_BUFFER_MASK) \
                                & ~RXDMA_BUFFER_MASK)

#    endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct up_dev_s
{
  bool            initialized;   /* Indicate that if has been initialized and HW is setup. */

  uint32_t        usartbase;     /* Base address of USART registers */
  uint32_t        baud;          /* Configured baud */
  uint32_t        clock;         /* Clock frequency */
  uint32_t        irq;           /* IRQ associated with this USART */
  uint8_t         parity;        /* 0=none, 1=odd, 2=even */
  uint8_t         bits;          /* Number of bits (7 or 8) */
  bool            stop_2bits;    /* True: Configure with 2 stop bits */
  spinlock_t      lock;          /* Spinlock for LTE UART */

#ifdef CONFIG_SERIAL_TERMIOS

#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  bool            iflow;         /* input flow control (RTS) enabled */
#  endif
#  ifdef CONFIG_SERIAL_OFLOWCONTROL
  bool            oflow;         /* output flow control (CTS) enabled */
#  endif
  uint32_t        tx_gpio;       /* USART TX GPIO pin configuration */
  uint32_t        rx_gpio;       /* USART RX GPIO pin configuration */

#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  uint32_t        rts_gpio;      /* UART RTS GPIO pin configuration */
#  endif
#  ifdef CONFIG_SERIAL_OFLOWCONTROL
  uint32_t        cts_gpio;      /* UART CTS GPIO pin configuration */
#  endif

#else /* CONFIG_SERIAL_TERMIOS */

#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  const bool      iflow;         /* input flow control (RTS) enabled */
#  endif
#  ifdef CONFIG_SERIAL_OFLOWCONTROL
  const bool      oflow;         /* output flow control (CTS) enabled */
#  endif
  const uint32_t  tx_gpio;       /* USART TX GPIO pin configuration */
  const uint32_t  rx_gpio;       /* USART RX GPIO pin configuration */

#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  const uint32_t  rts_gpio;      /* UART RTS GPIO pin configuration */
#  endif
#  ifdef CONFIG_SERIAL_OFLOWCONTROL
  const uint32_t  cts_gpio;      /* UART CTS GPIO pin configuration */
#  endif

#endif /* CONFIG_SERIAL_TERMIOS */

#ifdef HAVE_RS485
  const uint32_t  rs485_dir_gpio;       /* USART RS-485 DIR GPIO pin */
  const bool      rs485_dir_polarity;   /* USART RS-485 DIR TXEN polarity */
#endif

  /* DMA configuration and state */

#ifdef SERIAL_HAVE_RXDMA
  uint32_t        rxdma_channel; /* DMA channel assigned for RX */
  uint32_t        rxdmanext;     /* Next byte in the DMA buffer to be read */
  char *const     rxfifo;        /* Receive DMA buffer */
  DMA_HANDLE      rxdma;         /* currently-open receive DMA stream */
  bool            rxenable;      /* DMA-based reception en/disable */
#endif
#ifdef SERIAL_HAVE_TXDMA
  uint32_t        txdma_channel; /* DMA channel assigned for TX */
  DMA_HANDLE      txdma;         /* currently-open transmit DMA stream */
#endif

  /* Interrupt management */

  uint32_t        ie;            /* Saved interrupt enable bits */
  uint32_t        sr;            /* Saved status register */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static inline uint32_t up_serialin(struct up_dev_s *priv, int offset);
static inline void up_serialout(struct up_dev_s *priv, int offset,
                                uint32_t value);
static void up_setusartint(struct up_dev_s *priv, uint32_t ie);
static void up_disableusartint(struct up_dev_s *priv, uint32_t *ie);
static void up_restoreusartint(struct up_dev_s *priv, uint32_t ie);

static void gd32_usart_configure(struct uart_dev_s *dev);

