GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_serial.c
/* This describes the state of the GD32 USART0 port. */

#ifdef CONFIG_GD32E11X_USART0

static struct up_dev_s g_usart0priv =
{
  .usartbase     = GD32_USART0,
  .baud          = CONFIG_USART0_BAUD,
  .clock         = GD32_PCLK2_FREQUENCY,
  .irq           = GD32_IRQ_USART0,
  .parity        = CONFIG_USART0_PARITY,
  .bits          = CONFIG_USART0_BITS,
  .stop_2bits    = CONFIG_USART0_2STOP,

  .tx_gpio       = GPIO_USART0_TX,
  .rx_gpio       = GPIO_USART0_RX,
  .lock          = SP_UNLOCKED,
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_USART0_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_USART0_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_USART0_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_USART0_CTS,
#endif

#ifdef CONFIG_USART0_RS485
  .rs485_dir_gpio = GPIO_USART0_RS485_DIR,
#  if (CONFIG_USART0_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif

#ifdef CONFIG_GD32E11X_USART0_RXDMA
  .rxdma_channel = DMACHAN_USART0_RX,
  .rxfifo        = g_usart0rxfifo,
#endif
#ifdef CONFIG_GD32E11X_USART0_TXDMA
  .txdma_channel = DMACHAN_USART0_TX,
#endif
};

static struct uart_dev_s g_usart0port =
{
#if defined(CONSOLE_UART) && CONSOLE_UART == 0
  .isconsole = true,
#endif
  .recv      =
  {
    .size    = CONFIG_USART0_RXBUFSIZE,
    .buffer  = g_usart0rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_USART0_TXBUFSIZE,
    .buffer  = g_usart0txbuffer,
  },
#if defined(CONFIG_GD32E11X_USART0_RXDMA) && defined(CONFIG_GD32E11X_USART0_TXDMA)
  .ops       = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32E11X_USART0_RXDMA) && !defined(CONFIG_GD32E11X_USART0_TXDMA)
  .ops       = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32E11X_USART0_RXDMA) && defined(CONFIG_GD32E11X_USART0_TXDMA)
  .ops       = &g_uart_ops_tx_dma,
#else
  .ops       = &g_uart_ops_no_dma,
#endif
  .priv      = &g_usart0priv,
};

#endif

/* This describes the state of the GD32 USART1 port. */

#ifdef CONFIG_GD32E11X_USART1

static struct up_dev_s g_usart1priv =
{
  .usartbase     = GD32_USART1,
  .baud          = CONFIG_USART1_BAUD,
  .clock         = GD32_PCLK1_FREQUENCY,
  .irq           = GD32_IRQ_USART1,
  .parity        = CONFIG_USART1_PARITY,
  .bits          = CONFIG_USART1_BITS,
  .stop_2bits    = CONFIG_USART1_2STOP,

  .tx_gpio       = GPIO_USART1_TX,
  .rx_gpio       = GPIO_USART1_RX,
  .lock          = SP_UNLOCKED,
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_USART1_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_USART1_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_USART1_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_USART1_CTS,
#endif

#ifdef CONFIG_USART1_RS485
  .rs485_dir_gpio = GPIO_USART1_RS485_DIR,
#  if (CONFIG_USART1_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif

#ifdef CONFIG_GD32E11X_USART1_RXDMA
  .rxdma_channel = DMACHAN_USART1_RX,
  .rxfifo        = g_usart1rxfifo,
#endif
#ifdef CONFIG_GD32E11X_USART1_TXDMA
  .txdma_channel = DMACHAN_USART1_TX,
#endif
};

static struct uart_dev_s g_usart1port =
{
#if defined(CONSOLE_UART) && CONSOLE_UART == 1
  .isconsole = true,
#endif
  .recv      =
  {
    .size    = CONFIG_USART1_RXBUFSIZE,
    .buffer  = g_usart1rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_USART1_TXBUFSIZE,
    .buffer  = g_usart1txbuffer,
  },
#if defined(CONFIG_GD32E11X_USART1_RXDMA) && defined(CONFIG_GD32E11X_USART1_TXDMA)
  .ops       = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32E11X_USART1_RXDMA) && !defined(CONFIG_GD32E11X_USART1_TXDMA)
  .ops       = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32E11X_USART1_RXDMA) && defined(CONFIG_GD32E11X_USART1_TXDMA)
  .ops       = &g_uart_ops_tx_dma,
#else
  .ops       = &g_uart_ops_no_dma,
#endif
  .priv      = &g_usart1priv,
};

#endif

/* This describes the state of the GD32 USART2 port. */

#ifdef CONFIG_GD32E11X_USART2

static struct up_dev_s g_usart2priv =
{
  .usartbase     = GD32_USART2,
  .baud          = CONFIG_USART2_BAUD,
  .clock         = GD32_PCLK1_FREQUENCY,
  .irq           = GD32_IRQ_USART2,
  .parity        = CONFIG_USART2_PARITY,
  .bits          = CONFIG_USART2_BITS,
  .stop_2bits    = CONFIG_USART2_2STOP,

  .tx_gpio       = GPIO_USART2_TX,
  .rx_gpio       = GPIO_USART2_RX,
  .lock          = SP_UNLOCKED,
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_USART2_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_USART2_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_USART2_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_USART2_CTS,
#endif

#ifdef CONFIG_USART2_RS485
  .rs485_dir_gpio = GPIO_USART2_RS485_DIR,
#  if (CONFIG_USART2_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif

#ifdef CONFIG_GD32E11X_USART2_RXDMA
  .rxdma_channel = DMACHAN_USART2_RX,
  .rxfifo        = g_usart2rxfifo,
#endif
#ifdef CONFIG_GD32E11X_USART2_TXDMA
  .txdma_channel = DMACHAN_USART2_TX,
#endif
};

static struct uart_dev_s g_usart2port =
{
#if defined(CONSOLE_UART) && CONSOLE_UART == 2
  .isconsole = true,
#endif
  .recv      =
  {
    .size    = CONFIG_USART2_RXBUFSIZE,
    .buffer  = g_usart2rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_USART2_TXBUFSIZE,
    .buffer  = g_usart2txbuffer,
  },
#if defined(CONFIG_GD32E11X_USART2_RXDMA) && defined(CONFIG_GD32E11X_USART2_TXDMA)
  .ops       = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32E11X_USART2_RXDMA) && !defined(CONFIG_GD32E11X_USART2_TXDMA)
  .ops       = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32E11X_USART2_RXDMA) && defined(CONFIG_GD32E11X_USART2_TXDMA)
  .ops       = &g_uart_ops_tx_dma,
#else
  .ops       = &g_uart_ops_no_dma,
#endif
  .priv      = &g_usart2priv,
};

#endif

/* This describes the state of the GD32 UART3 port. */

#ifdef CONFIG_GD32E11X_UART3

static struct up_dev_s g_uart3priv =
{
  .usartbase     = GD32_UART3,
  .baud          = CONFIG_UART3_BAUD,
  .clock         = GD32_PCLK1_FREQUENCY,
  .irq           = GD32_IRQ_UART3,
  .parity        = CONFIG_UART3_PARITY,
  .bits          = CONFIG_UART3_BITS,
  .stop_2bits    = CONFIG_UART3_2STOP,

  .tx_gpio       = GPIO_UART3_TX,
  .rx_gpio       = GPIO_UART3_RX,
  .lock          = SP_UNLOCKED,
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART3_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_UART3_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_UART3_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_UART3_CTS,
#endif

