GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_serial.c
#ifdef CONFIG_UART3_RS485
  .rs485_dir_gpio = GPIO_UART3_RS485_DIR,
#  if (CONFIG_UART3_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif

#ifdef CONFIG_GD32E11X_UART3_RXDMA
  .rxdma_channel = DMACHAN_UART3_RX,
  .rxfifo        = g_uart3rxfifo,
#endif
#ifdef CONFIG_GD32E11X_UART3_TXDMA
  .txdma_channel = DMACHAN_UART3_TX,
#endif
};

static struct uart_dev_s g_uart3port =
{
#if defined(CONSOLE_UART) && CONSOLE_UART == 3
  .isconsole = true,
#endif
  .recv      =
  {
    .size    = CONFIG_UART3_RXBUFSIZE,
    .buffer  = g_uart3rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART3_TXBUFSIZE,
    .buffer  = g_uart3txbuffer,
  },
#if defined(CONFIG_GD32E11X_UART3_RXDMA) && defined(CONFIG_GD32E11X_UART3_TXDMA)
  .ops       = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32E11X_UART3_RXDMA) && !defined(CONFIG_GD32E11X_UART3_TXDMA)
  .ops       = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32E11X_UART3_RXDMA) && defined(CONFIG_GD32E11X_UART3_TXDMA)
  .ops       = &g_uart_ops_tx_dma,
#else
  .ops       = &g_uart_ops_no_dma,
#endif
  .priv      = &g_uart3priv,
};

#endif

/* This describes the state of the GD32 UART4 port. */

#ifdef CONFIG_GD32E11X_UART4

static struct up_dev_s g_uart4priv =
{
  .usartbase     = GD32_UART4,
  .baud          = CONFIG_UART4_BAUD,
  .clock         = GD32_PCLK1_FREQUENCY,
  .irq           = GD32_IRQ_UART4,
  .parity        = CONFIG_UART4_PARITY,
  .bits          = CONFIG_UART4_BITS,
  .stop_2bits    = CONFIG_UART4_2STOP,

  .tx_gpio       = GPIO_UART4_TX,
  .rx_gpio       = GPIO_UART4_RX,
  .lock          = SP_UNLOCKED,
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART4_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_UART4_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_UART4_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_UART4_CTS,
#endif

#ifdef CONFIG_UART4_RS485
  .rs485_dir_gpio = GPIO_UART4_RS485_DIR,
#  if (CONFIG_UART4_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif

#ifdef CONFIG_GD32E11X_UART4_RXDMA
  .rxdma_channel = DMACHAN_UART4_RX,
  .rxfifo        = g_uart4rxfifo,
#endif
#ifdef CONFIG_GD32E11X_UART4_TXDMA
  .txdma_channel = DMACHAN_UART4_TX,
#endif
};

static struct uart_dev_s g_uart4port =
{
#if defined(CONSOLE_UART) && CONSOLE_UART == 4
  .isconsole = true,
#endif
  .recv      =
  {
    .size    = CONFIG_UART4_RXBUFSIZE,
    .buffer  = g_uart4rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART4_TXBUFSIZE,
    .buffer  = g_uart4txbuffer,
  },
  .ops       = &g_uart_ops_no_dma,
  .priv      = &g_uart4priv,
};

#endif

/* This table lets us iterate over the configured USARTs */

static struct uart_dev_s * const g_uart_devs[GD32_NUSART] =
{
#ifdef CONFIG_GD32E11X_USART0
  [0] = &g_usart0port,
#endif
#ifdef CONFIG_GD32E11X_USART1
  [1] = &g_usart1port,
#endif
#ifdef CONFIG_GD32E11X_USART2
  [2] = &g_usart2port,
#endif
#ifdef CONFIG_GD32E11X_UART3
  [3] = &g_uart3port,
#endif
#ifdef CONFIG_GD32E11X_UART4
  [4] = &g_uart4port,
#endif
};

#ifdef CONFIG_PM
static struct pm_callback_s g_serial_pmcb =
{
  .notify  = up_pm_notify,
  .prepare = up_pm_prepare,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_serialin
 ****************************************************************************/

static inline uint32_t up_serialin(struct up_dev_s *priv, int offset)
{
  return getreg32(priv->usartbase + offset);
}

/****************************************************************************
 * Name: up_serialout
 ****************************************************************************/

static inline void up_serialout(struct up_dev_s *priv, int offset,
                                uint32_t value)
{
  putreg32(value, priv->usartbase + offset);
}

/****************************************************************************
 * Name: up_setusartint
 ****************************************************************************/

static void up_setusartint(struct up_dev_s *priv, uint32_t ie)
{
  uint32_t regval;

  /* Save the interrupt mask */

  priv->ie = ie;

  /* And restore the interrupt state (see the interrupt enable/usage
   * table above)
   */

  regval  = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval &= ~(USART_CTL0_USED_INTS);
  regval |= (ie & (USART_CTL0_USED_INTS));
  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

  regval  = up_serialin(priv, GD32_USART_CTL2_OFFSET);
  regval &= ~USART_CTL2_ERRIE;
  regval |= (ie & USART_CTL2_ERRIE);
  up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);
}

/****************************************************************************
 * Name: up_disableusartint
 ****************************************************************************/

static void up_disableusartint(struct up_dev_s *priv, uint32_t *ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  if (ie)
    {
      uint32_t ctl0;
      uint32_t ctl2;

      ctl0 = up_serialin(priv, GD32_USART_CTL0_OFFSET);
      ctl2 = up_serialin(priv, GD32_USART_CTL2_OFFSET);

      /* Return the current interrupt mask value for the used interrupts.
       * Notice that this depends on the fact that none of the used interrupt
       * enable bits overlap.  This logic would fail if we needed the break
       * interrupt!
       */

      *ie = (ctl0 & (USART_CTL0_USED_INTS)) | (ctl2 & USART_CTL2_ERRIE);
    }

  /* Disable all interrupts */

  up_setusartint(priv, 0);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: up_restoreusartint
 ****************************************************************************/

static void up_restoreusartint(struct up_dev_s *priv, uint32_t ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  up_setusartint(priv, ie);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: gd32_usart_configure
 *
 * Description:
 *   Configure the USART baud, bits, parity, etc.
 *
 ****************************************************************************/

