GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_serial.c
#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void gd32_usart_configure(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  uint32_t regval;
  uint32_t udiv;
  uint32_t intdiv;
  uint32_t fradiv;

  /* Reset USART */

  gd32_usart_reset(priv->usartbase);

  /* Configure baud rate (GD32E11x uses fixed 16x oversampling) */

  udiv   = (priv->clock + priv->baud / 2) / priv->baud;
  intdiv = udiv & 0xfff0;
  fradiv = udiv & 0xf;

  regval = ((USART_BAUD_FRADIV_MASK | USART_BAUD_INTDIV_MASK) &
            (intdiv | fradiv));
  up_serialout(priv, GD32_USART_BAUD_OFFSET, regval);

  /* Configure parity mode */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval &= ~(USART_CTL0_PM_MASK | USART_CTL0_WL);

  if (priv->parity == 1)
    {
      /* Configure as odd parity */

      regval |= USART_CTL0_PM_ODD;
    }
  else if (priv->parity == 2)
    {
      /* Configure as even parity */

      regval |= USART_CTL0_PM_EVEN;
    }

  /* Configure USART word length */

  if (priv->bits == 9 || (priv->bits == 8 && priv->parity != 0))
    {
      regval |= USART_WL_9BIT;
    }
  else
    {
      regval |= USART_WL_8BIT;
    }

  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

  /* Configure STOP bits */

  regval = up_serialin(priv, GD32_USART_CTL1_OFFSET);
  regval &= ~(USART_CTL1_STB_MASK);

  if (priv->stop_2bits)
    {
      regval |= USART_CTL1_STB2BIT;
    }

  up_serialout(priv, GD32_USART_CTL1_OFFSET, regval);

  /* Configure hardware flow control */

  regval  = up_serialin(priv, GD32_USART_CTL2_OFFSET);
  regval &= ~(USART_CTL2_RTSEN | USART_CTL2_CTSEN);

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && \
   !defined(CONFIG_GD32E11X_FLOWCONTROL_BROKEN)
  if (priv->iflow && (priv->rts_gpio != 0))
    {
      regval |= USART_CTL2_RTSEN;
    }
#endif

#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->oflow && (priv->cts_gpio != 0))
    {
      regval |= USART_CTL2_CTSEN;
    }
#endif

  up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);
}
#endif /* CONFIG_SUPPRESS_UART_CONFIG */

/****************************************************************************
 * Name: up_setup
 *
 * Description:
 *   Configure the USART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

static int up_setup(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

#ifndef CONFIG_SUPPRESS_UART_CONFIG
  uint32_t regval;

  /* Enable USART clock */

  gd32_usart_clock_enable(priv->usartbase);

  /* Configure pins for USART use */

  gd32_gpio_config(priv->tx_gpio);
  gd32_gpio_config(priv->rx_gpio);

#ifdef CONFIG_SERIAL_IFLOWCONTROL
  if (priv->iflow)
    {
      gd32_gpio_config(priv->rts_gpio);
    }
#endif

#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->oflow)
    {
      gd32_gpio_config(priv->cts_gpio);
    }
#endif

#ifdef HAVE_RS485
  if (priv->rs485_dir_gpio != 0)
    {
      gd32_gpio_config(priv->rs485_dir_gpio);
      gd32_gpio_write(priv->rs485_dir_gpio, !priv->rs485_dir_polarity);
    }
#endif

  /* Configure the USART */

  gd32_usart_configure(dev);

  /* Enable Rx, Tx, and the USART */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval |= (USART_CTL0_UEN | USART_CTL0_TEN | USART_CTL0_REN);
  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

#endif /* CONFIG_SUPPRESS_UART_CONFIG */

  return OK;
}

/****************************************************************************
 * Name: up_shutdown
 *
 * Description:
 *   Disable the USART.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

static void up_shutdown(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  uint32_t regval;

  /* Disable all interrupts */

  up_disableusartint(priv, NULL);

  /* Disable USART */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval &= ~USART_CTL0_UEN;
  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

  /* Disable USART clock */

  gd32_usart_clock_disable(priv->usartbase);
}

/****************************************************************************
 * Name: up_dma_nextrx
 *
 * Description:
 *   Get the next DMA reception position
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static size_t up_dma_nextrx(struct up_dev_s *priv)
{
  size_t dmaresidual;

  dmaresidual = gd32_dma_transnum_get(priv->rxdma);

  return (RXDMA_BUFFER_SIZE - (size_t)dmaresidual);
}
#endif

/****************************************************************************
 * Name: up_dma_setup
 *
 * Description:
 *   Configure the USART baud, bits, parity, etc. This method is called
 *   for DMA-enabled serial ports.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static int up_dma_setup(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  int result;

  /* Do the basic UART setup first, unless we are the console */

  if (!dev->isconsole)
    {
      result = up_setup(dev);
      if (result != OK)
        {
          return result;
        }
    }

  /* Acquire the DMA channel for RX if configured */

#ifdef SERIAL_HAVE_RXDMA
  if (priv->rxdma_channel != 0)
    {
      priv->rxdma = gd32_dma_channel_alloc(priv->rxdma_channel);
      if (priv->rxdma == NULL)
        {
          return -EBUSY;
        }

      /* Configure for circular DMA reception into the RX FIFO */

      dma_parameter_struct dma_init_struct;

      dma_init_struct.direction = DMA_PERIPH_TO_MEMORY;
      dma_init_struct.memory_addr = (uint32_t)priv->rxfifo;
      dma_init_struct.number = RXDMA_BUFFER_SIZE;
      dma_init_struct.periph_addr = priv->usartbase + GD32_USART_DATA_OFFSET;
      dma_init_struct.periph_width = DMA_PERIPH_WIDTH_8BIT;
      dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
      dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
      dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
      dma_init_struct.priority = USART_DMA_PRIO;

      gd32_dma_setup(priv->rxdma, &dma_init_struct, 1);

      /* Reset DMA reading position */

      priv->rxdmanext = 0;

