GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_serial.c
      /* Start the DMA channel FIRST, then enable USART DMA
       * (per GD32 official demo sequence)
       */

      gd32_dma_start(priv->rxdma, up_dma_rx_callback, dev, RXDMA_INT_MASK);

      /* Enable receive DMA for the UART */

      uint32_t regval = up_serialin(priv, GD32_USART_CTL2_OFFSET);
      regval |= USART_CTL2_DENR;
      up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);
    }
#endif

  /* Acquire the DMA channel for TX if configured */

#ifdef SERIAL_HAVE_TXDMA
  if (priv->txdma_channel != 0)
    {
      priv->txdma = gd32_dma_channel_alloc(priv->txdma_channel);
      if (priv->txdma == NULL)
        {
#ifdef SERIAL_HAVE_RXDMA
          if (priv->rxdma)
            {
              gd32_dma_channel_free(priv->rxdma);
              priv->rxdma = NULL;
            }
#endif

          return -EBUSY;
        }

      /* Enable transmit DMA for the UART */

      uint32_t regval = up_serialin(priv, GD32_USART_CTL2_OFFSET);
      regval |= USART_CTL2_DENT;
      up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);
    }
#endif

  priv->initialized = true;

  return OK;
}
#endif

/****************************************************************************
 * Name: up_dma_shutdown
 *
 * Description:
 *   Disable the USART.  This method is called when the serial
 *   port is closed (DMA version)
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static void up_dma_shutdown(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  /* Stop and free the RX DMA channel */

#ifdef SERIAL_HAVE_RXDMA
  if (priv->rxdma != NULL)
    {
      gd32_dma_stop(priv->rxdma);
      gd32_dma_channel_free(priv->rxdma);
      priv->rxdma = NULL;
    }
#endif

  /* Stop and free the TX DMA channel */

#ifdef SERIAL_HAVE_TXDMA
  if (priv->txdma != NULL)
    {
      gd32_dma_stop(priv->txdma);
      gd32_dma_channel_free(priv->txdma);
      priv->txdma = NULL;
    }
#endif

  priv->initialized = false;

  /* Perform the standard shutdown */

  up_shutdown(dev);
}
#endif

/****************************************************************************
 * Name: up_attach
 *
 * Description:
 *   Configure the USART to operation in interrupt driven mode.  This method
 *   is called when the serial port is opened.  Normally, this is just after
 *   the setup() method is called, however, the serial console may operate in
 *   a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled by the attach method (unless the
 *   hardware supports multiple levels of interrupt enabling).  The RX and TX
 *   interrupts are not enabled until the txint() and rxint() methods are
 *   called.
 *
 ****************************************************************************/

static int up_attach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  int ret;

  /* Attach and enable the IRQ */

  ret = irq_attach(priv->irq, up_interrupt, dev);
  if (ret == OK)
    {
      /* Enable the interrupt (RX and TX interrupts are still disabled
       * in the USART
       */

      up_enable_irq(priv->irq);
    }

  return ret;
}

/****************************************************************************
 * Name: up_detach
 *
 * Description:
 *   Detach USART interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.  The
 *   exception is the serial console which is never shutdown.
 *
 ****************************************************************************/

static void up_detach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  /* Disable interrupts */

  up_disableusartint(priv, NULL);
  up_disable_irq(priv->irq);

  /* Detach from the interrupt */

  irq_detach(priv->irq);
}

/****************************************************************************
 * Name: up_interrupt
 *
 * Description:
 *   This is the USART interrupt handler.  It will be invoked when an
 *   interrupt is received on the 'irq'.  It should call uart_xmitchars or
 *   uart_recvchars to perform the appropriate data transfers.  The
 *   interrupt handling logic must be able to map the 'arg' to the
 *   appropriate uart_dev_s structure in order to call these functions.
 *
 ****************************************************************************/

static int up_interrupt(int irq, void *context, void *arg)
{
  struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  struct up_dev_s   *priv;
  int                passes;
  bool handled;

  DEBUGASSERT(dev != NULL && dev->priv != NULL);
  priv = (struct up_dev_s *)dev->priv;

#if defined(CONFIG_PM) && CONFIG_GD32E11X_PM_SERIAL_ACTIVITY > 0
  /* Report serial activity to the power management logic */

  pm_activity(PM_IDLE_DOMAIN, CONFIG_GD32E11X_PM_SERIAL_ACTIVITY);
#endif

  /* Loop until there are no characters to be transferred or,
   * until we have been looping for a long time.
   */

  handled = true;
  for (passes = 0; passes < 256 && handled; passes++)
    {
      handled = false;

      /* Get the masked USART status */

      priv->sr = up_serialin(priv, GD32_USART_STAT0_OFFSET);

#ifdef HAVE_RS485
      /* Transmission is complete */

      if (((priv->sr & USART_STAT0_TC) != 0) &&
          ((priv->ie & USART_CTL0_TCIE) != 0) &&
          ((priv->ie & USART_CTL0_TBEIE) != 0))
        {
          gd32_gpio_write(priv->rs485_dir_gpio, !priv->rs485_dir_polarity);
          up_restoreusartint(priv, priv->ie);
        }
#endif

      /* Handle incoming, receive bytes */

      if (((priv->sr & USART_STAT0_RBNE) != 0) &&
          ((priv->ie & USART_CTL0_RBNEIE) != 0))
        {
          /* Received data ready... process incoming bytes */

          uart_recvchars(dev);
          handled = true;
        }

#ifdef SERIAL_HAVE_RXDMA
      /* Handle IDLE interrupt for DMA reception */

      if (((priv->sr & USART_STAT0_IDLEF) != 0) &&
          ((priv->ie & USART_CTL0_IDLEIE) != 0))
        {
          uart_recvchars(dev);

