GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_serial.c
          /* Clear IDLE flag by reading DATA register */

          up_serialin(priv, GD32_USART_DATA_OFFSET);
          handled = true;
        }
#endif

      /* Clear USART error flags */

      if ((priv->sr & (USART_STAT0_ORERR | USART_STAT0_NERR |
                       USART_STAT0_FERR | USART_STAT0_PERR)) != 0)
        {
          /* Clear the error by reading the data register */

          up_serialin(priv, GD32_USART_DATA_OFFSET);
        }

      /* Handle outgoing, transmit bytes */

      if (((priv->sr & USART_STAT0_TBE) != 0) &&
          ((priv->ie & USART_CTL0_TBEIE) != 0))
        {
          /* Transmit data register empty ... process outgoing bytes */

          uart_xmitchars(dev);
          handled = true;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: up_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int up_ioctl(struct file *filep, int cmd, unsigned long arg)
{
#if defined(CONFIG_SERIAL_TERMIOS) || defined(CONFIG_SERIAL_TIOCSERGSTRUCT)
  struct inode      *inode = filep->f_inode;
  struct uart_dev_s *dev   = inode->i_private;
#endif
  int                ret   = OK;

  switch (cmd)
    {
#ifdef CONFIG_SERIAL_TIOCSERGSTRUCT
    case TIOCSERGSTRUCT:
      {
         struct up_dev_s *user = (struct up_dev_s *)arg;
         if (!user)
           {
             ret = -EINVAL;
           }
         else
           {
             memcpy(user, dev, sizeof(struct up_dev_s));
           }
       }
       break;
#endif

#ifdef CONFIG_SERIAL_TERMIOS
    case TCGETS:
      {
        struct termios *termiosp = (struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* The driver only support 8/9 bit modes and therefore is
         * no way to report 9-bit mode, we always claim 8.
         */

        termiosp->c_cflag =
          ((priv->parity != 0) ? PARENB : 0) |
          ((priv->parity == 1) ? PARODD : 0) |
          ((priv->stop_2bits) ? CSTOPB : 0) |
#ifdef CONFIG_SERIAL_IFLOWCONTROL
          ((priv->iflow) ? CRTS_IFLOW : 0) |
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
          ((priv->oflow) ? CCTS_OFLOW : 0) |
#endif
          CS8;

        cfsetispeed(termiosp, priv->baud);

        /* TODO: CRTS_IFLOW, CCTS_OFLOW */
      }
      break;

    case TCSETS:
      {
        struct termios *termiosp = (struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* Perform some sanity checks before accepting any changes */

        if (((termiosp->c_cflag & CSIZE) != CS8)
#ifdef CONFIG_SERIAL_IFLOWCONTROL
            || ((termiosp->c_cflag & CRTS_IFLOW) && (priv->rts_gpio == 0))
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
            || ((termiosp->c_cflag & CCTS_OFLOW) && (priv->cts_gpio == 0))
#endif
           )
          {
            ret = -EINVAL;
            break;
          }

        if (termiosp->c_cflag & PARENB)
          {
            priv->parity = (termiosp->c_cflag & PARODD) ? 1 : 2;
          }
        else
          {
            priv->parity = 0;
          }

        priv->stop_2bits = (termiosp->c_cflag & CSTOPB) != 0;
#ifdef CONFIG_SERIAL_IFLOWCONTROL
        priv->iflow = (termiosp->c_cflag & CRTS_IFLOW) != 0;
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
        priv->oflow = (termiosp->c_cflag & CCTS_OFLOW) != 0;
#endif

        /* Note that since there is no way to request 9-bit mode
         * and no way to support 5/6/7-bit modes, we ignore them
         * all here.
         */

        /* Note that only cfgetispeed is used because we have knowledge
         * that only one speed is supported.
         */

        priv->baud = cfgetispeed(termiosp);

        /* Effect the changes immediately - note that we do not implement
         * TCSADRAIN / TCSAFLUSH
         */

        gd32_usart_configure(dev);
      }
      break;
#endif /* CONFIG_SERIAL_TERMIOS */

#ifdef CONFIG_GD32E11X_USART_BREAKS
#  ifdef CONFIG_GD32E11X_SERIALBRK_BSDCOMPAT
    case TIOCSBRK:  /* BSD compatibility: Turn break on, unconditionally */
      {
        irqstate_t flags;
        uint32_t tx_break;

        flags = enter_critical_section();

       /* Disconnect TX to USART */

        up_txint(dev, false);

        /* Configure TX as a GPIO output pin and Send a break signal */

        tx_break = (~(GPIO_CFG_MODE_MASK | GPIO_CFG_OUTPUT_SET) &
                    priv->tx_gpio) | GPIO_CFG_MODE_OUTPUT;
        gd32_gpio_config(tx_break);

        leave_critical_section(flags);
      }
      break;

    case TIOCCBRK:  /* BSD compatibility: Turn break off, unconditionally */
      {
        irqstate_t flags;

        flags = enter_critical_section();

        /* Connect TX to USART */

        gd32_gpio_config(priv->tx_gpio);

        /* Enable further tx activity */

        up_txint(dev, true);

        leave_critical_section(flags);
      }
      break;
#  else /* CONFIG_GD32E11X_SERIALBRK_BSDCOMPAT */
    case TIOCSBRK:  /* No BSD compatibility: Turn break on for M bit times */
      {
        irqstate_t flags;

        flags = enter_critical_section();
        regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
        regval |= USART_CTL0_SBKCMD;
        up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);
        leave_critical_section(flags);
      }
      break;

    case TIOCCBRK:  /* No BSD compatibility: May turn off break too soon */
      {
        uint32_t cr1;
        irqstate_t flags;

        flags = enter_critical_section();
        regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
        regval &= ~ USART_CTL0_SBKCMD;
        up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);
        leave_critical_section(flags);
      }
      break;
#  endif
#endif /* CONFIG_GD32E11X_USART_BREAKS */

  /* Only available in USART0,1,2 */

#ifdef CONFIG_GD32E11X_USART_INVERT
    case TIOCSINVERT:
      {
        uint32_t regaddr;
        irqstate_t flags;

        flags = enter_critical_section();

        regval = up_serialin(priv, GD32_USART_CTL3_OFFSET);

        if (arg & SER_INVERT_ENABLED_RX)
          {
            regval |= USART_CTL3_RINV;
          }
        else
          {
            regval &= ~USART_CTL3_RINV;
          }

        if (arg & SER_INVERT_ENABLED_TX)
          {
            regval |= USART_CTL3_TINV;
          }
        else
          {
            regval &= ~USART_CTL3_TINV;
          }

        /* R/TINV bit fields can written when UEN in CTL0 is 0 */

        regaddr = GD32_USART_CTL0(priv->usartbase);

