GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_serial.c
#if defined(CONFIG_SERIAL_IFLOWCONTROL_WATERMARKS) && \
    defined(CONFIG_GD32E11X_FLOWCONTROL_BROKEN)
  if (priv->iflow && (priv->rts_gpio != 0))
    {
      /* Assert/de-assert nRTS set it high resume/stop sending */

      gd32_gpio_write(priv->rts_gpio, upper);

      if (upper)
        {
          /* With heavy Rx traffic, RXNE might be set and data pending.
           * Returning 'true' in such case would cause RXNE left unhandled
           * and causing interrupt storm. Sending end might be also be slow
           * to react on nRTS, and returning 'true' here would prevent
           * processing that data.
           *
           * Therefore, return 'false' so input data is still being processed
           * until sending end reacts on nRTS signal and stops sending more.
           */

          return false;
        }

      return upper;
    }

#else
  if (priv->iflow)
    {
      /* Is the RX buffer full? */

      if (upper)
        {
          /* Disable Rx interrupt to prevent more data being from
           * peripheral.  When hardware RTS is enabled, this will
           * prevent more data from coming in.
           *
           * This function is only called when UART recv buffer is full,
           * that is: "dev->recv.head + 1 == dev->recv.tail".
           *
           * Logic in "uart_read" will automatically toggle Rx interrupts
           * when buffer is read empty and thus we do not have to re-
           * enable Rx interrupts.
           */

          uart_disablerxint(dev);
          return true;
        }

      /* No.. The RX buffer is empty */

      else
        {
          /* We might leave Rx interrupt disabled if full recv buffer was
           * read empty.  Enable Rx interrupt to make sure that more input
           * is received.
           */

          uart_enablerxint(dev);
        }
    }
#endif

  return false;
}
#endif

/****************************************************************************
 * Name: up_send
 *
 * Description:
 *   This method will send one byte on the USART
 *
 ****************************************************************************/

static void up_send(struct uart_dev_s *dev, int ch)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

#ifdef HAVE_RS485
  if (priv->rs485_dir_gpio != 0)
    {
      gd32_gpio_write(priv->rs485_dir_gpio, priv->rs485_dir_polarity);
    }
#endif

  up_serialout(priv, GD32_USART_DATA_OFFSET, (uint32_t)ch);
}

/****************************************************************************
 * Name: up_dma_send
 *
 * Description:
 *   Start DMA transfer for TX
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_TXDMA
static void up_dma_send(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  dma_parameter_struct dma_init_struct;

  /* Stop any ongoing DMA */

  gd32_dma_stop(priv->txdma);

  /* Reset the number sent */

  dev->dmatx.nbytes = 0;

  /* Configure DMA for transmit */

  dma_init_struct.direction = DMA_MEMORY_TO_PERIPH;
  dma_init_struct.memory_addr = (uint32_t)dev->dmatx.buffer;
  dma_init_struct.number = dev->dmatx.length;
  dma_init_struct.periph_addr = priv->usartbase + GD32_USART_DATA_OFFSET;
  dma_init_struct.periph_width = DMA_PERIPH_WIDTH_8BIT;
  dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
  dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
  dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
  dma_init_struct.priority = USART_DMA_PRIO;

  gd32_dma_setup(priv->txdma, &dma_init_struct, 0);

  /* Start transmission with callback */

  gd32_dma_start(priv->txdma, up_dma_tx_callback, (void *)dev,
                 DMA_INT_MASK);

  /* Wait for TX to complete */

  while (up_txempty(dev) == 0);
}
#endif

/****************************************************************************
 * Name: up_dma_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts (DMA version)
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_TXDMA
static void up_dma_txint(struct uart_dev_s *dev, bool enable)
{
  /* Nothing to do - DMA handles it */
}
#endif

/****************************************************************************
 * Name: up_dma_txavailable
 *
 * Description:
 *   Informs DMA that Tx data is available
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_TXDMA
static void up_dma_txavailable(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  /* Only send when the DMA is idle */

  if (gd32_dma_transnum_get(priv->txdma) == 0)
    {
      uart_xmitchars_dma(dev);
    }
}
#endif

/****************************************************************************
 * Name: up_dma_tx_callback
 *
 * Description:
 *   DMA TX callback - called when DMA transfer completes
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_TXDMA
static void up_dma_tx_callback(DMA_HANDLE handle, uint16_t status, void *arg)
{
  struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  /* Update bytes transferred */

  if (status & DMA_INTF_FTFIF)
    {
      dev->dmatx.nbytes += dev->dmatx.length;
      if (dev->dmatx.nlength)
        {
          /* Set up DMA on next buffer */

          dma_parameter_struct dma_init_struct;

          dma_init_struct.direction = DMA_MEMORY_TO_PERIPH;
          dma_init_struct.memory_addr = (uint32_t)dev->dmatx.nbuffer;
          dma_init_struct.number = dev->dmatx.nlength;
          dma_init_struct.periph_addr = priv->usartbase +
                                        GD32_USART_DATA_OFFSET;
          dma_init_struct.periph_width = DMA_PERIPH_WIDTH_8BIT;
          dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
          dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
          dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
          dma_init_struct.priority = USART_DMA_PRIO;

