GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_serial.c
          gd32_dma_setup(priv->txdma, &dma_init_struct, 0);

          dev->dmatx.length  = dev->dmatx.nlength;
          dev->dmatx.nlength = 0;

          gd32_dma_start(priv->txdma, up_dma_tx_callback,
                         (void *)dev, DMA_INT_MASK);

          return;
        }
    }
  else if (status & DMA_INTF_HTFIF)
    {
      dev->dmatx.nbytes += dev->dmatx.length / 2;
    }

  uart_xmitchars_done(dev);
}
#endif

/****************************************************************************
 * Name: up_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts
 *
 ****************************************************************************/

#if defined(SERIAL_HAVE_RX_DMA) || defined(SERIAL_NOT_HAVE_DMA) || \
    defined(CONFIG_GD32E11X_SERIALBRK_BSDCOMPAT)
static void up_txint(struct uart_dev_s *dev, bool enable)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);
  if (enable)
    {
      /* Enable the TX interrupt */

#ifndef CONFIG_SUPPRESS_SERIAL_INTS
      uint32_t ie = priv->ie | USART_CTL0_TBEIE;
      ie |= USART_CTL0_TBEIE;
      up_setusartint(priv, ie);

      /* If RS-485 is supported on this USART, also enable the TCIE */

#  ifdef HAVE_RS485
      if (priv->rs485_dir_gpio != 0)
        {
          ie |= USART_CTL0_INT_TCIE;
        }
#  endif

#else
      /* Fake a TX interrupt here by just calling uart_xmitchars() with
       * interrupts disabled (note this may recurse).
       */

      uart_xmitchars(dev);
#endif
    }
  else
    {
      /* Disable the TX interrupt */

      uint32_t ie = priv->ie & ~USART_CTL0_TBEIE;
      up_setusartint(priv, ie);
    }

  spin_unlock_irqrestore(&priv->lock, flags);
}
#endif

/****************************************************************************
 * Name: up_txready
 *
 * Description:
 *   Return true if the tranmsit data register is empty
 *
 ****************************************************************************/

static bool up_txready(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  return ((up_serialin(priv, GD32_USART_STAT0_OFFSET) &
           USART_STAT0_TBE) != 0);
}

/****************************************************************************
 * Name: up_txempty
 *
 * Description:
 *   Return true if the transmit data register is empty
 *
 ****************************************************************************/

static bool up_txempty(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  return ((up_serialin(priv, GD32_USART_STAT0_OFFSET) &
           USART_STAT0_TC) != 0);
}

/****************************************************************************
 * Name: up_pm_notify
 *
 * Description:
 *   Notify the driver of new power state. This callback is  called after
 *   all drivers have had the opportunity to prepare for the new power state.
 *
 ****************************************************************************/

#ifdef CONFIG_PM
static void up_pm_notify(struct pm_callback_s *cb, int domain,
                         enum pm_state_e pmstate)
{
  switch (pmstate)
    {
      case (PM_NORMAL):
        {
          /* Logic for PM_NORMAL goes here */
        }
        break;

      case (PM_IDLE):
        {
          /* Logic for PM_IDLE goes here */
        }
        break;

      case (PM_STANDBY):
        {
          /* Logic for PM_STANDBY goes here */
        }
        break;

      case (PM_SLEEP):
        {
          /* Logic for PM_SLEEP goes here */
        }
        break;

      default:

        /* Should not get here */

        break;
    }
}
#endif

/****************************************************************************
 * Name: up_pm_prepare
 *
 * Description:
 *   Request the driver to prepare for a new power state. This is a warning
 *   that the system is about to enter into a new power state. The driver
 *   should begin whatever operations that may be required to enter power
 *   state. The driver may abort the state change mode by returning a
 *   non-zero value from the callback function.
 *
 ****************************************************************************/

#ifdef CONFIG_PM
static int up_pm_prepare(struct pm_callback_s *cb, int domain,
                         enum pm_state_e pmstate)
{
  /* Logic to prepare for a reduced power state goes here. */

  return OK;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

#ifdef USE_SERIALDRIVER

/****************************************************************************
 * Name: gd32_serial_get_uart
 *
 * Description:
 *   Get serial driver structure for GD32 USART
 *
 ****************************************************************************/

#ifdef HAVE_SERIALDRIVER
uart_dev_t *gd32_serial_get_uart(int uart_idx)
{
  if (uart_idx < 0 || uart_idx >= GD32_NUSART || !g_uart_devs[uart_idx])
    {
      return NULL;
    }

  struct up_dev_s *priv = (struct up_dev_s *)g_uart_devs[uart_idx]->priv;
  if (!priv->initialized)
    {
      return NULL;
    }

  return g_uart_devs[uart_idx];
}
#endif /* HAVE_SERIALDRIVER */
#endif /* USE_SERIALDRIVER */

#ifdef USE_EARLYSERIALINIT

/****************************************************************************
 * Name: arm_earlyserialinit
 *
 * Description:
 *   Performs the low level USART initialization early in debug so that the
 *   serial console will be available during boot-up.  This must be called
 *   before arm_serialinit.
 *
 ****************************************************************************/

void arm_earlyserialinit(void)
{
  unsigned i;

  /* Disable all USART interrupts */

  for (i = 0; i < GD32_NUSART; i++)
    {
      if (g_uart_devs[i])
        {
          up_disableusartint(g_uart_devs[i]->priv, NULL);
        }
    }

  /* Configure console early (so we can use it for boot messages)
   * For DMA-enabled consoles, we still use non-DMA setup here because
   * DMA infrastructure may not be ready. DMA will be initialized later
   * when the device is formally opened.
   */

#ifdef CONSOLE_UART
  g_uart_devs[CONSOLE_UART]->isconsole = true;

  /* Always use basic setup for early console - DMA requires full
   * system initialization which is not available at this point.
   */

  up_setup(g_uart_devs[CONSOLE_UART]);
#endif
}
#endif

/****************************************************************************
 * Name: arm_serialinit
 *
 * Description:
 *   Register serial console and serial ports.  This assumes
 *   that arm_earlyserialinit was called previously.
 *
 ****************************************************************************/

void arm_serialinit(void)
{
  int i;
  int start = 0;
  char devname[16];

#ifdef CONSOLE_UART
  /* For DMA-enabled console, we need to initialize DMA here because
   * the console was already set up without DMA in arm_earlyserialinit().
   * The NuttX serial layer may skip setup() for console devices.
   */

