GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_serial.c
#if defined(SERIAL_HAVE_RXDMA) || defined(SERIAL_HAVE_TXDMA)
  struct uart_dev_s *dev = g_uart_devs[CONSOLE_UART];

  if (dev->ops->setup)
    {
      dev->ops->setup(dev);
    }
#endif

  /* Register the console */

  uart_register("/dev/console", g_uart_devs[CONSOLE_UART]);
#endif

  /* Register all USARTs */

  strcpy(devname, "/dev/ttySx");

  for (i = 0; i < GD32_NUSART; i++)
    {
      /* Don't create a device for non-configured ports. */

      if (g_uart_devs[i] == NULL)
        {
          continue;
        }

#ifdef CONSOLE_UART
      /* Don't create a device for the console - we did that above */

      if (g_uart_devs[i]->isconsole)
        {
          continue;
        }
#endif

      /* Register USARTs as devices in increasing order */

      devname[9] = '0' + start++;
      uart_register(devname, g_uart_devs[i]);
    }

#ifdef CONFIG_PM
  /* Register to receive power management callbacks */

  int ret = pm_register(&g_serial_pmcb);
  DEBUGASSERT(ret == OK);
  UNUSED(ret);
#endif
}

/****************************************************************************
 * Name: gd32_serial_dma_poll
 *
 * Description:
 *   Checks receive DMA buffers for received bytes that have not accumulated
 *   to the point where the DMA half/full interrupt has triggered.
 *
 *   This function should be called from a timer or other periodic context.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
void gd32_serial_dma_poll(void)
{
  irqstate_t flags;

  flags = enter_critical_section();

#ifdef CONFIG_GD32E11X_USART0_RXDMA
  if (g_usart0priv.rxdma != NULL)
    {
      up_dma_rx_callback(g_usart0priv.rxdma, 0, &g_usart0port);
    }
#endif

#ifdef CONFIG_GD32E11X_USART1_RXDMA
  if (g_usart1priv.rxdma != NULL)
    {
      up_dma_rx_callback(g_usart1priv.rxdma, 0, &g_usart1port);
    }
#endif

#ifdef CONFIG_GD32E11X_USART2_RXDMA
  if (g_usart2priv.rxdma != NULL)
    {
      up_dma_rx_callback(g_usart2priv.rxdma, 0, &g_usart2port);
    }
#endif

#ifdef CONFIG_GD32E11X_UART3_RXDMA
  if (g_uart3priv.rxdma != NULL)
    {
      up_dma_rx_callback(g_uart3priv.rxdma, 0, &g_uart3port);
    }
#endif

#ifdef CONFIG_GD32E11X_UART4_RXDMA
  if (g_uart4priv.rxdma != NULL)
    {
      up_dma_rx_callback(g_uart4priv.rxdma, 0, &g_uart4port);
    }
#endif

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/

void up_putc(int ch)
{
#ifdef CONSOLE_UART

  struct up_dev_s *priv = (struct up_dev_s *)g_uart_devs[CONSOLE_UART]->priv;
  uint32_t ie;

  up_disableusartint(priv, &ie);
  arm_lowputc(ch);
  up_restoreusartint(priv, ie);
#endif
}

#  endif /* HAVE_SERIALDRIVER */
#endif /* USE_SERIALDRIVER */

#if !defined(USE_SERIALDRIVER)

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/

void up_putc(int ch)
{
#ifdef CONSOLE_UART
  arm_lowputc(ch);
#endif
}

#endif /* !USE_SERIALDRIVER */
